## Merging

In [33]:
import pandas as pd

In [34]:
df1 = pd.read_csv("files/books.csv", sep=';')
df1

   bookID             title  authorID
0    1001      Мертвые души      1101
1    1002    Евгений Онегин      1102
2    1003  Руслан и Людмила      1102
3    1004           Ревизор      1101
4    1005   Властелин колец      1109

In [35]:
df2 = pd.read_csv("files/authors.csv", sep=';')
df2

   authorID       author
0      1101       Гоголь
1      1102       Пушкин
2      1103     Тургенев
3      1104  Достоевский

In [36]:
df1.merge(df2, how="left", on="authorID")

   bookID             title  authorID  author
0    1001      Мертвые души      1101  Гоголь
1    1002    Евгений Онегин      1102  Пушкин
2    1003  Руслан и Людмила      1102  Пушкин
3    1004           Ревизор      1101  Гоголь
4    1005   Властелин колец      1109     NaN

In [37]:
df1.merge(df2, how="right", on="authorID")

   bookID             title  authorID       author
0  1001.0      Мертвые души      1101       Гоголь
1  1004.0           Ревизор      1101       Гоголь
2  1002.0    Евгений Онегин      1102       Пушкин
3  1003.0  Руслан и Людмила      1102       Пушкин
4     NaN               NaN      1103     Тургенев
5     NaN               NaN      1104  Достоевский

In [40]:
df1.merge(df2, how="outer", on="authorID")

   bookID             title  authorID       author
0  1001.0      Мертвые души      1101       Гоголь
1  1004.0           Ревизор      1101       Гоголь
2  1002.0    Евгений Онегин      1102       Пушкин
3  1003.0  Руслан и Людмила      1102       Пушкин
4     NaN               NaN      1103     Тургенев
5     NaN               NaN      1104  Достоевский
6  1005.0   Властелин колец      1109          NaN

In [43]:
pd.concat([df1, df2])

   bookID             title  authorID       author
0  1001.0      Мертвые души      1101          NaN
1  1002.0    Евгений Онегин      1102          NaN
2  1003.0  Руслан и Людмила      1102          NaN
3  1004.0           Ревизор      1101          NaN
4  1005.0   Властелин колец      1109          NaN
0     NaN               NaN      1101       Гоголь
1     NaN               NaN      1102       Пушкин
2     NaN               NaN      1103     Тургенев
3     NaN               NaN      1104  Достоевский

In [44]:
pd.concat([df1, df2], axis=1)

   bookID             title  authorID  authorID       author
0    1001      Мертвые души      1101    1101.0       Гоголь
1    1002    Евгений Онегин      1102    1102.0       Пушкин
2    1003  Руслан и Людмила      1102    1103.0     Тургенев
3    1004           Ревизор      1101    1104.0  Достоевский
4    1005   Властелин колец      1109       NaN          NaN